/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：Aggregator标准框架
2. 文件名：src -> system -> core -> libraries -> guid.js
3. 作者：liyang@lifang.com
4. 备注：系统核心模块 -> 工具库 -> 生成guId
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
class GUID {
    constructor() {

    }
   static s4() {
        return ((( 1 + Math.random() ) * 0x10000) | 0 ).toString(16).substring(1) ;
    }
    //生成GUID
    static create() {
        return this.s4() + this.s4() + "-" + this.s4() + "-" + this.s4() + "-" + this.s4() + "-" + this.s4() + this.s4() + this.s4() ;
    }
}

export default GUID ;